#### Database Management System

A special software program that helps users create and maintain a database. <br>
1. Makes it easy to manage large amounts of information. <br>
2. Handles security, backups. <br>
3. Importing/exporting data. <br>
4. Concurrency and interaction with software applications.

#### CRUD (Create, Read, Update, Delete)

CRUD represents four major operation that is performed in the database.

#### Two types of Databases (Relational/Non-Relational)

Relational Databases (SQL) - Organize data into one or more tables. Each table has rows and columns. <br>
A unique key identifies each row. <br>
Non-Relational Databaes (NoSQL) - Anytype of database that doesnot have relations. Key-value stores, XML, JSON, Graphs. <br>

Relation Databases uses SQL and store data in tables with rows and columns. <br>
Non Relational databases store data using other data structures.

In [73]:
# Primary Key is an attribute which uniquely define a row in the  table.
# Foreign Key stores the primary key of a row in another table.

#### SQL (Hybrid Language) 4 types

1. Data Query Language (DQL) - Used to query the database for information. Get information that is already stored. <br>
2. Data Definition Language (DDL) - Used for defining database schemas. <br>
3. Data Control Language (DCL) - Used for controlling access to the data in the database. Users & permissions management. <br>
4. Data Manipulation Language (DML) - Used for inserting, updating and deleting data from the database.

<img src="database.png" alt="Drawing" style="width: 900px; height: 650px"/>

In [1]:
%load_ext sql
%sql sqlite:///company_database.db

#### SELECT

In [2]:
%%sql
-- Find all employees ordered by salary
SELECT *
FROM employee
ORDER BY salary;

 * sqlite:///company_database.db
Done.

[(104, 'Kelly', 'Kapoor', '1980-02-05', 'F', 55000, 102, 2),
 (103, 'Angela', 'Martin', '1971-06-25', 'F', 63000, 102, 2),
 (107, 'Andy', 'Bernard', '1973-07-22', 'M', 65000, 106, 3),
 (105, 'Stanley', 'Hudson', '1958-02-19', 'M', 69000, 102, 2),
 (108, 'Jim', 'Halpert', '1978-10-01', 'M', 71000, 106, 3),
 (102, 'Michael', 'Scott', '1964-03-15', 'M', 75000, 100, 2),
 (106, 'Josh', 'Porter', '1969-09-05', 'M', 78000, 100, 3),
 (101, 'Jan', 'Levinson', '1961-05-11', 'F', 110000, 100, 1),
 (100, 'David', 'Wallace', '1967-11-17', 'M', 250000, None, 1)]

In [3]:
%%sql
-- Find all employees ordered by sex then name.
SELECT *
FROM employee
ORDER BY sex, first_name, last_name;

 * sqlite:///company_database.db
Done.

[(103, 'Angela', 'Martin', '1971-06-25', 'F', 63000, 102, 2),
 (101, 'Jan', 'Levinson', '1961-05-11', 'F', 110000, 100, 1),
 (104, 'Kelly', 'Kapoor', '1980-02-05', 'F', 55000, 102, 2),
 (107, 'Andy', 'Bernard', '1973-07-22', 'M', 65000, 106, 3),
 (100, 'David', 'Wallace', '1967-11-17', 'M', 250000, None, 1),
 (108, 'Jim', 'Halpert', '1978-10-01', 'M', 71000, 106, 3),
 (106, 'Josh', 'Porter', '1969-09-05', 'M', 78000, 100, 3),
 (102, 'Michael', 'Scott', '1964-03-15', 'M', 75000, 100, 2),
 (105, 'Stanley', 'Hudson', '1958-02-19', 'M', 69000, 102, 2)]

In [4]:
%%sql
-- Find the first name and last name of first 5 employees in the table.
SELECT first_name as Forename, last_name as Surname
FROM employee
LIMIT 5;

 * sqlite:///company_database.db
Done.

[('David', 'Wallace'),
 ('Jan', 'Levinson'),
 ('Michael', 'Scott'),
 ('Angela', 'Martin'),
 ('Kelly', 'Kapoor')]

In [5]:
%%sql
-- Find out all the different genders in employee table
SELECT DISTINCT sex
FROM employee;

 * sqlite:///company_database.db
Done.

[('M',), ('F',)]

#### SQL Functions

In [6]:
%%sql 
-- Find the number of employees.
SELECT COUNT(emp_id) as total_employees
FROM employee;

 * sqlite:///company_database.db
Done.

[(9,)]

In [7]:
%%sql
-- Find the number of female employees born after 1970.
SELECT COUNT(emp_id) as total_female_employees
FROM employee
WHERE sex='F' and birth_day > '1971-01-01';

 * sqlite:///company_database.db
Done.

[(2,)]

In [8]:
%%sql 
-- Find the average of all male employee salaries.
SELECT AVG(salary) as avg_salary 
FROM employee
WHERE sex='M';

 * sqlite:///company_database.db
Done.

[(101333.33333333333,)]

In [9]:
%%sql
-- Find the sum of all employee salaries.
SELECT SUM(salary) as total_sum
FROM employee;

 * sqlite:///company_database.db
Done.

[(836000,)]

#### GROUP BY

In [10]:
%%sql
-- Find out how many males and females there are
SELECT COUNT(sex), sex
FROM employee
GROUP BY sex;

 * sqlite:///company_database.db
Done.

[(3, 'F'), (6, 'M')]

In [11]:
%%sql
-- Find the total sales of each salesman.
SELECT emp_id, SUM(total_sales) as TotalSales
FROM works_with
GROUP BY emp_id;

 * sqlite:///company_database.db
Done.

[(102, 282000), (105, 218000), (107, 31000), (108, 34500)]

#### WildCards

% : Any # characters. <br>
_ : One character.

In [12]:
%%sql
-- Find any clients who are an LLC
SELECT *
FROM client
WHERE client_name LIKE '%LLC';

 * sqlite:///company_database.db
Done.

[(403, 'John Daly Law, LLC', 3)]

In [13]:
%%sql
-- Find any branch suppliers who are in the label business
SELECT * 
FROM branch_supplier
WHERE supplier_name LIKE '% Label%';

 * sqlite:///company_database.db
Done.

[(2, 'J.T. Forms & Labels', 'Custom Forms')]

In [14]:
%%sql
-- Find any employee born in October
SELECT *
FROM employee
WHERE birth_day LIKE "%-10-%"

 * sqlite:///company_database.db
Done.

[(108, 'Jim', 'Halpert', '1978-10-01', 'M', 71000, 106, 3)]

In [15]:
%%sql
-- Find any clients who are schools
SELECT * 
FROM client
WHERE client_name LIKE '%school%';

 * sqlite:///company_database.db
Done.

[(400, 'Dunmore Highschool', 2)]

#### Unions

Unions is a sql operator which we can use to combine the results from multiple select statements into one. <br>
Must have same number of columns and data types.

In [16]:
%%sql
-- Find a list of employee and branch names
SELECT first_name AS Result_Names
FROM employee
UNION
SELECT branch_name
FROM branch
UNION
SELECT client_name 
FROM client;

 * sqlite:///company_database.db
Done.

[('Andy',),
 ('Angela',),
 ('Buffalo',),
 ('Corporate',),
 ('David',),
 ('Dunmore Highschool',),
 ('FedEx',),
 ('Jan',),
 ('Jim',),
 ('John Daly Law, LLC',),
 ('Josh',),
 ('Kelly',),
 ('Lackawana Country',),
 ('Michael',),
 ('Scranton',),
 ('Scranton Whitepages',),
 ('Stamford',),
 ('Stanley',),
 ('Times Newspaper',)]

#### Joins
<img src="https://miro.medium.com/max/828/0*gdxxtAKE9vYAjXBk.webp" alt="Drawing" style="width: 900px; height: 650px"/>

A JOIN is used to map together two tables on the basis of a condition specified by the ON clause. <br>
 After the FROM statement, we have two new statements: JOIN, which is followed by a table name, and ON, which is followed by a couple column names separated by an equals sign.

INNER JOIN <br>
Inner joins eliminate rows from both tables that do not satisfy the join condition set forth in the ON statement. In mathematical terms, an inner join is the intersection of the two tables. <br>


OUTER JOIN <br>
When performing an inner join, rows from either table that are unmatched in the other table are not returned. In an outer join, unmatched rows in one or both tables can be returned. There are a few types of outer joins: <br>

LEFT JOIN returns only unmatched rows from the left table. <br>
RIGHT JOIN returns only unmatched rows from the right table. <br>
FULL OUTER JOIN returns unmatched rows from both tables.

In [17]:
%%sql
-- Find all branches and the name of their managers
SELECT employee.emp_id, employee.first_name, branch.branch_name
FROM employee
JOIN branch
ON employee.emp_id == branch.mgr_id;

 * sqlite:///company_database.db
Done.

[(100, 'David', 'Corporate'),
 (102, 'Michael', 'Scranton'),
 (106, 'Josh', 'Stamford')]

#### Nested Queries

In [21]:
%%sql
-- Find names of all employees who have sold over 30,000 to a single client.
SELECT employee.first_name, employee.last_name
FROM employee
WHERE employee.emp_id IN (
SELECT works_with.emp_id
FROM works_with
WHERE total_sales > 30000
);

 * sqlite:///company_database.db
Done.

[('Michael', 'Scott'), ('Stanley', 'Hudson')]

In [26]:
%%sql
-- Find all clients who are handled by the branch that Micheal Scott Manages assume you know michael id
SELECT client.client_name
FROM client
WHERE branch_id = (
SELECT branch.branch_id 
FROM branch
WHERE mgr_id=102
);

 * sqlite:///company_database.db
Done.

[('Dunmore Highschool',),
 ('Lackawana Country',),
 ('Scranton Whitepages',),
 ('FedEx',)]